{"pageProps":{"post":{"title":"How to Stake your ADA","date":"2021-02-13T03:00:01.322Z","slug":"staking","author":{"name":"RaceX Team","picture":"/assets/blog/authors/racex.png"},"excerpt":"Staking is a process of delegating your ADAs, to a Stake pool to secure the blockchain using PoS (Proof-of-Stack) consensus, that operates on the descentralized Cardano network. As a result you're rewarded with ADA.","content":"<p>Staking is a process of delegating your ADAs, to a Stake pool to secure the blockchain using PoS (Proof-of-Stack) consensus, that operates on the descentralized Cardano network. As a result you're rewarded with ADA.</p>\n<p>The process from your side is relative simple, using your Cardano official wallet <a href=\"https://daedaluswallet.io/\"><strong>Daedalus</strong></a> or <a href=\"https://yoroi-wallet.com/\"><strong>Yoroi</strong></a>. Go to a Staking Center and search for our ticker <strong>RACEX</strong> and then choose delegate.</p>\n<h2>Rewards</h2>\n<p>Rewards are distributed out every <strong>5 days</strong> which is the end of a <strong>EPOCH</strong>, but if this your firt time delegating to any Cardano stake pool, there will be a slight delay from when you staked to when you start receiving the rewards that's between 15 to 20 days.</p>\n<h2>Fees</h2>\n<p>Our fees will always be competitive and fair. At the begin we set a 0% margin until we reach 2M ADA staked then will increase to 2%.</p>\n<p>The registration fee is set to it's minimum 340 ADA fixed fee.</p>\n<h2>How to choose</h2>\n<p>Choosing a stake pool is sometimes confusing, larger pools seems to give better rewards but this is a temporary view, when it reachs the saturation limit earns will decrease.</p>\n<p>Which means that in the long ran no matter which size of pool you go, will always gonna get an avarega the same rewards return, as long as you're in a reliable pool.</p>\n<p>How it is regulated, the algorith that rules the node selection, will be bias to keep the pools as balanced as possible.</p>\n<h2>Security Advise</h2>\n<p><strong>DO NOT NEVER</strong> transfer any ADA to anyone saying that's related with Stake pool, as you can see by now, the staking process do not need that. Your balance will keep in your wallet and you can use it whenever you want.</p>\n","ogImage":{"url":"/assets/blog/staking/cover.jpeg"},"coverImage":"/assets/blog/staking/cover.jpeg"}},"__N_SSG":true}